*** What are the exact licensing terms for GStreamer and its plugins?

All of GStreamer, including our own plugin code, is licensed under the [[https://www.gnu.org/licenses/lgpl-2.1.html][GNU LGPL 2.1]] license.
Some of the libraries used for some of the plugins are however under GPL, which means that those
plugins can not be used by a non-GPL-compatible application. Those are few and far between though
and there are usually non-GPL alternatives available for those GPL libraries.

As a general rule, GStreamer aims at using only *LGPL* or *BSD* licensed libraries and only use
*GPL* or proprietary libraries when no good LGPL or BSD aternatives are available.

You can see the effective license of a plugin as the *License* field in the output of the 
following command:

#+BEGIN_SRC shell
gst-inspect-1.0 <plugin name> | grep -i license
#+END_SRC

sample example 
#+BEGIN_SRC shell
gst-inspect-1.0 videocrop | grep -i license
#+END_SRC

#+RESULTS:
: License            LGPL

